#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.yandex_cm_certificate.ai_radio_cert will be read during apply
  # (config refers to values not yet known)
 <= data "yandex_cm_certificate" "ai_radio_cert" {
      + certificate_id      = (known after apply)
      + challenges          = (known after apply)
      + created_at          = (known after apply)
      + deletion_protection = (known after apply)
      + description         = (known after apply)
      + domains             = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + issued_at           = (known after apply)
      + issuer              = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + not_after           = (known after apply)
      + not_before          = (known after apply)
      + serial              = (known after apply)
      + status              = (known after apply)
      + subject             = (known after apply)
      + type                = (known after apply)
      + updated_at          = (known after apply)
      + wait_validation     = true
    }

  # data.yandex_lockbox_secret_version.aws_sa_static_key_version will be read during apply
  # (config refers to values not yet known)
 <= data "yandex_lockbox_secret_version" "aws_sa_static_key_version" {
      + entries    = (known after apply)
      + id         = (known after apply)
      + secret_id  = (known after apply)
      + version_id = (known after apply)
    }

  # data.yandex_lockbox_secret_version.tts_sa_static_key_version will be read during apply
  # (config refers to values not yet known)
 <= data "yandex_lockbox_secret_version" "tts_sa_static_key_version" {
      + entries    = (known after apply)
      + id         = (known after apply)
      + secret_id  = (known after apply)
      + version_id = (known after apply)
    }

  # yandex_api_gateway.static_gateway will be created
  + resource "yandex_api_gateway" "static_gateway" {
      + created_at        = (known after apply)
      + description       = "gateway for ai-radio.ru static website"
      + domain            = (known after apply)
      + execution_timeout = "30"
      + folder_id         = (known after apply)
      + id                = (known after apply)
      + log_group_id      = (known after apply)
      + name              = "ai_radio_static_gateway"
      + spec              = <<-EOT
            openapi: "3.0.0"
            info:
              version: 1.0.0
              title: AI Radio Website
            
            paths:
              /:
                get:
                  operationId: index
                  x-yc-apigateway-integration:
                    type: object_storage
                    bucket: 'ai_radio_website'
                    object: 'index.html'
              /ping:
                get:
                  x-yc-apigateway-integration:
                    type: dummy
                    http_code: 200
                    content:
                      "text/plain": "pong"
              /{file+}:
                get:
                  operationId: website
                  parameters:
                    - name: file
                      in: path
                      required: false
                      schema:
                        type: string
                  x-yc-apigateway-integration:
                    type: object_storage
                    bucket: 'ai_radio_website'
                    object: '{file}'
        EOT
      + status            = (known after apply)
      + user_domains      = (known after apply)

      + connectivity {
          + network_id = (known after apply)
        }

      + custom_domains {
          + certificate_id = (known after apply)
          + domain_id      = (known after apply)
          + fqdn           = "ai-radio.ru"
        }

      + log_options {
          + log_group_id = (known after apply)
        }
    }

  # yandex_cm_certificate.ai_radio_cert will be created
  + resource "yandex_cm_certificate" "ai_radio_cert" {
      + challenges = (known after apply)
      + created_at = (known after apply)
      + domains    = [
          + "ai-radio.ru",
        ]
      + folder_id  = (known after apply)
      + id         = (known after apply)
      + issued_at  = (known after apply)
      + issuer     = (known after apply)
      + name       = "ai_radio_cert"
      + not_after  = (known after apply)
      + not_before = (known after apply)
      + serial     = (known after apply)
      + status     = (known after apply)
      + subject    = (known after apply)
      + type       = (known after apply)
      + updated_at = (known after apply)

      + managed {
          + challenge_type = "DNS_TXT"
        }
    }

  # yandex_container_registry.ai_radio_registry will be created
  + resource "yandex_container_registry" "ai_radio_registry" {
      + created_at = (known after apply)
      + folder_id  = (known after apply)
      + id         = (known after apply)
      + name       = "ai_radio_registry"
      + status     = (known after apply)
    }

  # yandex_container_registry_iam_binding.ai_radio_caster_puller will be created
  + resource "yandex_container_registry_iam_binding" "ai_radio_caster_puller" {
      + id          = (known after apply)
      + members     = (known after apply)
      + registry_id = (known after apply)
      + role        = "container-registry.images.puller"
    }

  # yandex_container_repository.ai_radio_caster will be created
  + resource "yandex_container_repository" "ai_radio_caster" {
      + id   = (known after apply)
      + name = (known after apply)
    }

  # yandex_container_repository_lifecycle_policy.ai_radio_caster_policy will be created
  + resource "yandex_container_repository_lifecycle_policy" "ai_radio_caster_policy" {
      + created_at    = (known after apply)
      + description   = (known after apply)
      + id            = (known after apply)
      + name          = "ai_radio_caster_policy"
      + repository_id = (known after apply)
      + status        = "active"

      + rule {
          + description  = "remove old versions"
          + retained_top = 1
          + tag_regexp   = ".*"
          + untagged     = true
        }
    }

  # yandex_dns_recordset.ai_radio_a_stream will be created
  + resource "yandex_dns_recordset" "ai_radio_a_stream" {
      + data    = (known after apply)
      + id      = (known after apply)
      + name    = "stream.ai-radio.ru."
      + ttl     = 600
      + type    = "A"
      + zone_id = (known after apply)
    }

  # yandex_dns_recordset.ai_radio_aname_root will be created
  + resource "yandex_dns_recordset" "ai_radio_aname_root" {
      + data    = (known after apply)
      + id      = (known after apply)
      + name    = "@"
      + ttl     = 600
      + type    = "ANAME"
      + zone_id = (known after apply)
    }

  # yandex_dns_recordset.ai_radio_aname_www will be created
  + resource "yandex_dns_recordset" "ai_radio_aname_www" {
      + data    = (known after apply)
      + id      = (known after apply)
      + name    = "www.ai-radio.ru."
      + ttl     = 600
      + type    = "ANAME"
      + zone_id = (known after apply)
    }

  # yandex_dns_recordset.ai_radio_validation_record will be created
  + resource "yandex_dns_recordset" "ai_radio_validation_record" {
      + data    = (known after apply)
      + id      = (known after apply)
      + name    = (known after apply)
      + ttl     = 10
      + type    = (known after apply)
      + zone_id = (known after apply)
    }

  # yandex_dns_zone.ai_radio_zone will be created
  + resource "yandex_dns_zone" "ai_radio_zone" {
      + created_at       = (known after apply)
      + description      = "dns zone"
      + folder_id        = (known after apply)
      + id               = (known after apply)
      + name             = "ai-radio-zone"
      + private_networks = (known after apply)
      + public           = true
      + zone             = "ai-radio.ru."
    }

  # yandex_iam_service_account.aws_sa will be created
  + resource "yandex_iam_service_account" "aws_sa" {
      + created_at  = (known after apply)
      + description = "AWS-like service account for ai-radio.ru"
      + folder_id   = (known after apply)
      + id          = (known after apply)
      + name        = "aws_sa"
    }

  # yandex_iam_service_account.container_registry_sa will be created
  + resource "yandex_iam_service_account" "container_registry_sa" {
      + created_at = (known after apply)
      + folder_id  = (known after apply)
      + id         = (known after apply)
      + name       = "ai-radio-registry-sa"
    }

  # yandex_iam_service_account.tts_sa will be created
  + resource "yandex_iam_service_account" "tts_sa" {
      + created_at  = (known after apply)
      + description = "tts service account for ai-radio.ru"
      + folder_id   = (known after apply)
      + id          = (known after apply)
      + name        = "tts_sa"
    }

  # yandex_iam_service_account_api_key.tts_sa_api_key will be created
  + resource "yandex_iam_service_account_api_key" "tts_sa_api_key" {
      + created_at                   = (known after apply)
      + encrypted_secret_key         = (known after apply)
      + id                           = (known after apply)
      + key_fingerprint              = (known after apply)
      + output_to_lockbox_version_id = (known after apply)
      + scopes                       = [
          + "yc.ai.speechkitTts.execute",
        ]
      + secret_key                   = (sensitive value)
      + service_account_id           = (known after apply)

      + output_to_lockbox {
          + entry_for_secret_key = "SECRET_KEY"
          + secret_id            = (known after apply)
        }
    }

  # yandex_iam_service_account_static_access_key.aws_sa_static_key will be created
  + resource "yandex_iam_service_account_static_access_key" "aws_sa_static_key" {
      + access_key                   = (known after apply)
      + created_at                   = (known after apply)
      + encrypted_secret_key         = (known after apply)
      + id                           = (known after apply)
      + key_fingerprint              = (known after apply)
      + output_to_lockbox_version_id = (known after apply)
      + secret_key                   = (sensitive value)
      + service_account_id           = (known after apply)

      + output_to_lockbox {
          + entry_for_access_key = "ACCESS_KEY"
          + entry_for_secret_key = "SECRET_KEY"
          + secret_id            = (known after apply)
        }
    }

  # yandex_lockbox_secret.aws will be created
  + resource "yandex_lockbox_secret" "aws" {
      + created_at = (known after apply)
      + folder_id  = (known after apply)
      + id         = (known after apply)
      + name       = "ai_radio_music"
      + status     = (known after apply)
    }

  # yandex_lockbox_secret.tts will be created
  + resource "yandex_lockbox_secret" "tts" {
      + created_at = (known after apply)
      + folder_id  = (known after apply)
      + id         = (known after apply)
      + name       = "tts"
      + status     = (known after apply)
    }

  # yandex_lockbox_secret_iam_binding.aws_viewer will be created
  + resource "yandex_lockbox_secret_iam_binding" "aws_viewer" {
      + id        = (known after apply)
      + members   = (known after apply)
      + role      = "viewer"
      + secret_id = (known after apply)
    }

  # yandex_lockbox_secret_iam_binding.tts_viewer will be created
  + resource "yandex_lockbox_secret_iam_binding" "tts_viewer" {
      + id        = (known after apply)
      + members   = (known after apply)
      + role      = "viewer"
      + secret_id = (known after apply)
    }

  # yandex_logging_group.static_gateway_log will be created
  + resource "yandex_logging_group" "static_gateway_log" {
      + cloud_id         = (known after apply)
      + created_at       = (known after apply)
      + folder_id        = (known after apply)
      + id               = (known after apply)
      + name             = "static_gateway_log"
      + retention_period = (known after apply)
      + status           = (known after apply)
    }

  # yandex_message_queue.ai_radio_voice_gen will be created
  + resource "yandex_message_queue" "ai_radio_voice_gen" {
      + access_key                  = (known after apply)
      + arn                         = (known after apply)
      + content_based_deduplication = true
      + delay_seconds               = 0
      + fifo_queue                  = true
      + id                          = (known after apply)
      + max_message_size            = 262144
      + message_retention_seconds   = 345600
      + name                        = "ai_radio_voice_gen.fifo"
      + receive_wait_time_seconds   = 2
      + redrive_policy              = (known after apply)
      + region_id                   = "ru-central1"
      + secret_key                  = (sensitive value)
      + visibility_timeout_seconds  = 600
    }

  # yandex_message_queue.ai_radio_voice_gen_dlq will be created
  + resource "yandex_message_queue" "ai_radio_voice_gen_dlq" {
      + access_key                  = (known after apply)
      + arn                         = (known after apply)
      + content_based_deduplication = true
      + delay_seconds               = 0
      + fifo_queue                  = true
      + id                          = (known after apply)
      + max_message_size            = 262144
      + message_retention_seconds   = 345600
      + name                        = "ai_radio_voice_gen_dlq.fifo"
      + receive_wait_time_seconds   = 0
      + region_id                   = "ru-central1"
      + secret_key                  = (sensitive value)
      + visibility_timeout_seconds  = 30
    }

  # yandex_organizationmanager_group.ai_radio_dev will be created
  + resource "yandex_organizationmanager_group" "ai_radio_dev" {
      + created_at      = (known after apply)
      + description     = "ai-radio.ru developers"
      + id              = (known after apply)
      + name            = "ai_radio_dev"
      + organization_id = "bpf87tprvvpe4i8ub7a0"
    }

  # yandex_organizationmanager_group.ai_radio_ops will be created
  + resource "yandex_organizationmanager_group" "ai_radio_ops" {
      + created_at      = (known after apply)
      + description     = "ai-radio.ru operations"
      + id              = (known after apply)
      + name            = "ai_radio_ops"
      + organization_id = "bpf87tprvvpe4i8ub7a0"
    }

  # yandex_organizationmanager_group_membership.ai_radio_dev_membership will be created
  + resource "yandex_organizationmanager_group_membership" "ai_radio_dev_membership" {
      + group_id = (known after apply)
      + id       = (known after apply)
      + members  = [
          + "aje1e3sfjnu8oh37arpr",
        ]
    }

  # yandex_organizationmanager_group_membership.ai_radio_ops_membership will be created
  + resource "yandex_organizationmanager_group_membership" "ai_radio_ops_membership" {
      + group_id = (known after apply)
      + id       = (known after apply)
      + members  = [
          + "aje1e3sfjnu8oh37arpr",
        ]
    }

  # yandex_organizationmanager_organization_iam_member.ai_radio_dev_auditor will be created
  + resource "yandex_organizationmanager_organization_iam_member" "ai_radio_dev_auditor" {
      + id              = (known after apply)
      + member          = (known after apply)
      + organization_id = "bpf87tprvvpe4i8ub7a0"
      + role            = "auditor"
    }

  # yandex_organizationmanager_organization_iam_member.ai_radio_dev_logging_reader will be created
  + resource "yandex_organizationmanager_organization_iam_member" "ai_radio_dev_logging_reader" {
      + id              = (known after apply)
      + member          = (known after apply)
      + organization_id = "bpf87tprvvpe4i8ub7a0"
      + role            = "logging.reader"
    }

  # yandex_organizationmanager_organization_iam_member.ai_radio_dev_monitoring_editor will be created
  + resource "yandex_organizationmanager_organization_iam_member" "ai_radio_dev_monitoring_editor" {
      + id              = (known after apply)
      + member          = (known after apply)
      + organization_id = "bpf87tprvvpe4i8ub7a0"
      + role            = "monitoring.editor"
    }

  # yandex_organizationmanager_organization_iam_member.ai_radio_dev_monitoring_viewer will be created
  + resource "yandex_organizationmanager_organization_iam_member" "ai_radio_dev_monitoring_viewer" {
      + id              = (known after apply)
      + member          = (known after apply)
      + organization_id = "bpf87tprvvpe4i8ub7a0"
      + role            = "monitoring.viewer"
    }

  # yandex_organizationmanager_organization_iam_member.ai_radio_dev_viewer will be created
  + resource "yandex_organizationmanager_organization_iam_member" "ai_radio_dev_viewer" {
      + id              = (known after apply)
      + member          = (known after apply)
      + organization_id = "bpf87tprvvpe4i8ub7a0"
      + role            = "viewer"
    }

  # yandex_resourcemanager_cloud.ai_radio_prod will be created
  + resource "yandex_resourcemanager_cloud" "ai_radio_prod" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + name            = "ai_radio_prod"
      + organization_id = "bpf87tprvvpe4i8ub7a0"
    }

  # yandex_resourcemanager_folder.logs will be created
  + resource "yandex_resourcemanager_folder" "logs" {
      + cloud_id   = (known after apply)
      + created_at = (known after apply)
      + id         = (known after apply)
      + name       = "logs"
    }

  # yandex_resourcemanager_folder.network will be created
  + resource "yandex_resourcemanager_folder" "network" {
      + cloud_id   = (known after apply)
      + created_at = (known after apply)
      + id         = (known after apply)
      + name       = "network"
    }

  # yandex_resourcemanager_folder.registry will be created
  + resource "yandex_resourcemanager_folder" "registry" {
      + cloud_id   = (known after apply)
      + created_at = (known after apply)
      + id         = (known after apply)
      + name       = "registry"
    }

  # yandex_resourcemanager_folder.sa will be created
  + resource "yandex_resourcemanager_folder" "sa" {
      + cloud_id   = (known after apply)
      + created_at = (known after apply)
      + id         = (known after apply)
      + name       = "sa"
    }

  # yandex_resourcemanager_folder.secrets will be created
  + resource "yandex_resourcemanager_folder" "secrets" {
      + cloud_id   = (known after apply)
      + created_at = (known after apply)
      + id         = (known after apply)
      + name       = "secrets"
    }

  # yandex_resourcemanager_folder.storage will be created
  + resource "yandex_resourcemanager_folder" "storage" {
      + cloud_id   = (known after apply)
      + created_at = (known after apply)
      + id         = (known after apply)
      + name       = "storage"
    }

  # yandex_resourcemanager_folder_iam_member.aws_sa_os_uploader will be created
  + resource "yandex_resourcemanager_folder_iam_member" "aws_sa_os_uploader" {
      + folder_id = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + role      = "storage.uploader"
    }

  # yandex_resourcemanager_folder_iam_member.aws_sa_ymq_reader will be created
  + resource "yandex_resourcemanager_folder_iam_member" "aws_sa_ymq_reader" {
      + folder_id = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + role      = "ymq.reader"
    }

  # yandex_resourcemanager_folder_iam_member.aws_sa_ymq_writer will be created
  + resource "yandex_resourcemanager_folder_iam_member" "aws_sa_ymq_writer" {
      + folder_id = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + role      = "ymq.writer"
    }

  # yandex_resourcemanager_folder_iam_member.container_registry_sa_images_puller will be created
  + resource "yandex_resourcemanager_folder_iam_member" "container_registry_sa_images_puller" {
      + folder_id = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + role      = "container-registry.images.puller"
    }

  # yandex_resourcemanager_folder_iam_member.tts_sa_tts_user will be created
  + resource "yandex_resourcemanager_folder_iam_member" "tts_sa_tts_user" {
      + folder_id = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + role      = "ai.speechkit-tts.user"
    }

  # yandex_storage_bucket.ai_radio_music_bucket will be created
  + resource "yandex_storage_bucket" "ai_radio_music_bucket" {
      + access_key            = (known after apply)
      + bucket                = "ai_radio_music"
      + bucket_domain_name    = (known after apply)
      + default_storage_class = (known after apply)
      + folder_id             = (known after apply)
      + force_destroy         = false
      + id                    = (known after apply)
      + secret_key            = (sensitive value)
      + website_domain        = (known after apply)
      + website_endpoint      = (known after apply)

      + anonymous_access_flags (known after apply)

      + versioning (known after apply)
    }

  # yandex_storage_bucket.ai_radio_website_bucket will be created
  + resource "yandex_storage_bucket" "ai_radio_website_bucket" {
      + access_key            = (known after apply)
      + acl                   = "public-read"
      + bucket                = "ai_radio_website"
      + bucket_domain_name    = (known after apply)
      + default_storage_class = (known after apply)
      + folder_id             = (known after apply)
      + force_destroy         = false
      + id                    = (known after apply)
      + secret_key            = (sensitive value)
      + website_domain        = (known after apply)
      + website_endpoint      = (known after apply)

      + anonymous_access_flags (known after apply)

      + versioning (known after apply)
    }

  # yandex_vpc_address.ai_radio_stream_ip will be created
  + resource "yandex_vpc_address" "ai_radio_stream_ip" {
      + created_at          = (known after apply)
      + deletion_protection = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = "ai_radio_stream_ip_d"
      + reserved            = (known after apply)
      + used                = (known after apply)

      + external_ipv4_address {
          + address                  = (known after apply)
          + ddos_protection_provider = "qrator"
          + outgoing_smtp_capability = (known after apply)
          + zone_id                  = "ru-central1-d"
        }
    }

  # yandex_vpc_default_security_group.default_sg will be created
  + resource "yandex_vpc_default_security_group" "default_sg" {
      + created_at = (known after apply)
      + folder_id  = (known after apply)
      + id         = (known after apply)
      + labels     = (known after apply)
      + name       = (known after apply)
      + network_id = (known after apply)
      + status     = (known after apply)

      + egress {
          + description       = "To internet"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + protocol          = "ANY"
          + to_port           = -1
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }

      + ingress {
          + description       = "Communication inside this SG"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + predefined_target = "self_security_group"
          + protocol          = "ANY"
          + to_port           = -1
          + v4_cidr_blocks    = []
          + v6_cidr_blocks    = []
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + description       = "ICMP"
          + from_port         = 0
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + protocol          = "ICMP"
          + to_port           = 65535
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
      + ingress {
          + description       = "NLB health check"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + predefined_target = "loadbalancer_healthchecks"
          + protocol          = "TCP"
          + to_port           = -1
          + v4_cidr_blocks    = []
          + v6_cidr_blocks    = []
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + description       = "RDP"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = 3389
          + protocol          = "ANY"
          + to_port           = -1
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
      + ingress {
          + description       = "healthchecks"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = 30080
          + predefined_target = "loadbalancer_healthchecks"
          + protocol          = "TCP"
          + to_port           = -1
          + v4_cidr_blocks    = []
          + v6_cidr_blocks    = []
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + description       = "https from internet"
          + from_port         = 0
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + protocol          = "TCP"
          + to_port           = 443
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
      + ingress {
          + description       = "ssh"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = 22
          + protocol          = "ANY"
          + to_port           = -1
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
    }

  # yandex_vpc_gateway.egress_gateway will be created
  + resource "yandex_vpc_gateway" "egress_gateway" {
      + created_at = (known after apply)
      + folder_id  = (known after apply)
      + id         = (known after apply)
      + labels     = (known after apply)
      + name       = "egress_gateway"

      + shared_egress_gateway {}
    }

  # yandex_vpc_network.network will be created
  + resource "yandex_vpc_network" "network" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + folder_id                 = (known after apply)
      + id                        = (known after apply)
      + labels                    = (known after apply)
      + name                      = "network"
      + subnet_ids                = (known after apply)
    }

  # yandex_vpc_route_table.route_table will be created
  + resource "yandex_vpc_route_table" "route_table" {
      + created_at = (known after apply)
      + folder_id  = (known after apply)
      + id         = (known after apply)
      + labels     = (known after apply)
      + name       = "route_table"
      + network_id = (known after apply)

      + static_route {
          + destination_prefix = "0.0.0.0/0"
          + gateway_id         = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + static_route {
          + destination_prefix = "0.0.0.0/0"
          + gateway_id         = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + static_route {
          + destination_prefix = "0.0.0.0/0"
          + gateway_id         = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + static_route {
          + destination_prefix = "0.0.0.0/0"
          + gateway_id         = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + static_route {
          + destination_prefix = "0.0.0.0/0"
          + gateway_id         = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + static_route {
          + destination_prefix = "0.0.0.0/0"
          + gateway_id         = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + static_route {
          + destination_prefix = "0.0.0.0/0"
          + gateway_id         = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + static_route {
          + destination_prefix = "0.0.0.0/0"
          + gateway_id         = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # yandex_vpc_subnet.private_subnet_a will be created
  + resource "yandex_vpc_subnet" "private_subnet_a" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "private_subnet_a"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.15.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

  # yandex_vpc_subnet.private_subnet_d will be created
  + resource "yandex_vpc_subnet" "private_subnet_d" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "private_subnet_d"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.5.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-d"
    }

Plan: 53 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ai_radio_stream_ip = (known after apply)
  + aws_access_key     = (sensitive value)
  + aws_secret_key     = (sensitive value)
  + tts_key            = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @valeter, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform validation`*